#include <stdio.h>
#include "menu.h"
void menu()         /*顶层菜单函数*/
{
	printf("******** 1. 显示基本信息 ********\n");
	printf("******** 2. 基本信息管理 ********\n");
	printf("******** 3. 学生成绩管理 ********\n");
	printf("******** 4. 考试成绩统计 ********\n");
	printf("******** 5. 根据条件查询 ********\n");
	printf("******** 0. 退出         ********\n");
}

void menuBase()     /*2、基本信息管理菜单函数*/
{
	printf("%%%%%%%% 1. 插入学生记录 %%%%%%%%\n");
	printf("%%%%%%%% 2. 删除学生记录 %%%%%%%%\n");
	printf("%%%%%%%% 3. 修改学生记录 %%%%%%%%\n");
	printf("%%%%%%%% 0. 返回上层菜单 %%%%%%%%\n");
}

void menuScore()     /*3、学生成绩管理菜单函数*/
{
	printf("@@@@@@@@ 1. 计算学生总分 @@@@@@@@\n");
	printf("@@@@@@@@ 2. 根据总分排名 @@@@@@@@\n");
	printf("@@@@@@@@ 0. 返回上层菜单 @@@@@@@@\n");
}

void menuCount()    /*4、考试成绩统计菜单函数*/
{
	printf("&&&&&&&& 1. 求课程最高分 &&&&&&&&\n");
	printf("&&&&&&&& 2. 求课程最低分 &&&&&&&&\n");
	printf("&&&&&&&& 3. 求课程平均分 &&&&&&&&\n");
	printf("&&&&&&&& 0. 返回上层菜单 &&&&&&&&\n");
}

void menuSearch()    /*5、根据条件查询菜单函数*/
{
	printf("######## 1. 按学号查询   ########\n");
	printf("######## 2. 按姓名查询   ########\n");
	printf("######## 3. 按名次查询   ########\n");
	printf("######## 0. 返回上层菜单 ########\n");
}
